{"id":1002,"date":"2022-04-28T08:16:10","date_gmt":"2022-04-28T08:16:10","guid":{"rendered":"https:\/\/inbank.com\/?p=1002"},"modified":"2022-10-28T21:56:03","modified_gmt":"2022-10-28T21:56:03","slug":"inbankshares-corp-reports-first-quarter-2022-financial-results","status":"publish","type":"post","link":"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2022-financial-results\/","title":{"rendered":"InBankshares, Corp Reports First Quarter 2022 Financial Results"},"content":{"rendered":"<p>Denver, CO – April 28, 2022 – InBankshares, Corp (OTCQX: INBC) (the “Company”), parent company of InBank (“InBank” or the “Bank”), today announced its unaudited financial results for the quarter ended March 31, 2022. The Company reported consolidated net income of $444,000 or $0.06 per share, for the first quarter of 2022 compared to $690,000, or $0.09 per share for the linked quarter and $661,000 or $0.09 per share for the first quarter of 2021.<\/p>\n<h4>Highlights for the quarter:<\/h4>\n<ul>\n<li>Core loan growth, excluding SBA Paycheck Protection Program (“PPP”) loans, of $55.2 million, or 13.3%, when compared to the linked quarter and up $134.3 million, or 39.8%, compared to Q1 2021<\/li>\n<li>Noninterest-bearing deposits grew $6.3 million, or 2.5%, compared to the linked quarter and $46.5 million, or 21.6%, and compared to Q1 2021, ending the quarter at 41.8% of total deposits<\/li>\n<li>Pre-provision net revenue (PPNR) was $1.0 million, compared to $1.4 million for the linked quarter, and $1.0 million for Q1 2021<\/li>\n<li>Excluding PPP loans, net interest income increased $792,000, or 17%, compared to Q1 2021, primarily due to interest income related to core loan and investment securities growth, partially offset by an increased interest expense due to the issuance of subordinated debt during Q4 2021<\/li>\n<li>Noninterest income was $856,000 compared to the linked quarter noninterest income of $934,000 and increased $318,000, or 59.1%, compared to Q1 2021<\/li>\n<li>Noninterest expense decreased $83,000, or 1.5%, compared to the linked quarter and decreased $71,000, or 1.2%, compared to Q1 2021<\/li>\n<\/ul>\n<p>“I continue to be impressed by our talented team of bankers as we continue to successfully win market share through expanding new banking relationships. This is evidenced by the continued strong core loan and deposit growth this quarter and over the last twelve months,” said Ed Francis, Chairman of the Board, President and Chief Executive Officer of the Company and InBank. Mr. Francis continued, “We also remain focused on enhancing our profitability, while growing our balance sheet, achieving favorable improvement in noninterest income and noninterest expense compared to the first quarter of 2021. It’s nice when we grow our balance sheet and improve core revenue, while also reducing our overhead expenses, and despite losing PPP loan fee income of $1.3 million in the first quarter of 2022 when compared to Q1 2021.”<\/p>\n<p>“InBank and Legacy Bank teams continue to collaborate in preparation for the upcoming merger and I am pleased to report that we have received all regulatory and Legacy shareholder approval, and now plan to close by early May 2022. We are looking forward to completion of the merger, the integration of our talented teams, and the expansion of InBank’s Colorado footprint. We are confident that the merger will enhance our relationships with our customers, position us to continue to attract new customers and bankers, and significantly improve our profitability,” Mr. Francis concluded.<\/p>\n<h4>Results of Operations<\/h4>\n<p><strong>Net income<\/strong> for the first quarter of 2022 was $444,000, or $0.06 per share, compared to net income of $690,000, or $0.09 per share, for the linked quarter, and $661,000, or $0.09 per share, for the same quarter last year. The decrease over the linked quarter was primarily the result of unfavorable variances in net interest income partially due to lower PPP loan income, loan loss provision expense due to core loan growth, and noninterest income. These unfavorable variances were partially offset by favorable variances in noninterest expense and income tax expense. The decrease from the same quarter last year was primarily the result of a decrease in net interest income, partially due to a $1.3 million decrease in PPP loan income, and an increase in loan loss provision expense, partially offset by favorable variances in noninterest income and noninterest expense.<\/p>\n<p><strong>Net interest margin<\/strong> (NIM), expressed as net interest income as a percentage of average earning assets, was 3.14% during the first quarter of 2022, compared to 3.31% during the linked quarter, and 3.98% during the same quarter last year.<\/p>\n<p><strong>Net interest income<\/strong> for the first quarter of 2022 was $5.6 million, a decrease of $299,000, or 5.0%, over the linked quarter, and a decrease of $511,000, or 8.3%, over the same quarter last year.<\/p>\n<ul>\n<li>Interest income decreased to $6.1 million from $6.4 million during the linked quarter and decreased from $6.5 million during the same quarter last year.\n<ul>\n<li>The decrease from the linked quarter was primarily due to lower PPP loan interest and fee income of $110,000, and a decline in core loan yield, partially offset by higher average core loan balances of $61.6 million and an increase in investment yield and balances.<\/li>\n<li>The decrease compared to same quarter last year was primarily the result of a decrease in PPP loan interest and fee income of $1.3 million, partially offset by increases of $96.1 million in average core loan balances and $86.9 million in average investment securities and other interest-bearing balances.<\/li>\n<\/ul>\n<\/li>\n<li>Interest expense decreased to $481,000 from $492,000 during the linked quarter and increased from $410,000 during the same quarter last year.\n<ul>\n<li>The decrease over the linked quarter was primarily due to decreases in average time deposit and other borrowing balances<\/li>\n<li>The increase from the same quarter last year was due to an increase in interest on subordinated debentures due to the $20 million private placement of 3.75% Fixed-toFloating Rate Subordinated Notes in the fourth quarter 2021, partially offset by a 12 basis point decrease in the average cost of deposits.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p><strong>Noninterest income<\/strong> for the first quarter of 2022 was $856,000, a decrease of $78,000, or 8.4%, over the linked quarter, and an increase of $318,000, or 59.1%, from the same quarter last year. The decrease over the linked quarter was primarily due to a decrease in gain on sale of SBA, CRE and mortgage loans, partially offset by an increase in gain on sale of other real estate (“OREO”). The increase from the same quarter last year was due to an increase in deposit service charge income, including commercial credit card interchange income and an increase in gain on sale of OREO.<\/p>\n<p><strong>Noninterest expense<\/strong> for the first quarter of 2022 was $5.6 million, a decrease of $83,000, or 1.5%, when compared to the linked quarter, and a decrease of $71,000, or 1.2%, from the same quarter last year. The decrease over the linked quarter was primarily due to decreases in merger and acquisition expense of $119,000 in connection with the Legacy Bank transaction, partially offset by an increase in salaries and employee benefits expense of $109,000, primarily due to fourth quarter adjustments for incentive compensation, higher payroll taxes, and higher 401(k) contributions, partially offset by lower insurance costs. The decrease over the same quarter last year was primarily due to a $290,000 reduction in salaries and employee benefits expense due to lower salary, incentive compensation, and payroll tax expense. Full time equivalent (“FTE”) employees were 110 at March 31, 2022, compared to 113 at December 31, 2021 and 106 at March 31, 2021. Merger and acquisition expense was $173,000 in the first quarter 2022.<\/p>\n<p>The Company’s efficiency ratio, which excludes gain on sales of securities and merger and acquisition expense, was 84.3% in the first quarter of 2022, compared with 79.2% in the linked quarter and 85.5% in the first quarter of 2021.<\/p>\n<h4>Balance Sheet Summary<\/h4>\n<p><strong>Total assets<\/strong> were $763.6 million at March 31, 2022, an increase of $18.3 million, or 2.5%, from $745.2 million at December 31, 2021. During the quarter, investment securities increased $9.2 million and total loans held-for-investment increased $48.9 million due to an increase in core loans of $55.2 million, partially offset by a decrease in PPP loans of $6.3 million. These increases were partially offset by a $48.2 million decrease in interest-bearing deposits in banks. Investment securities and reverse repurchase agreements combined were $249.1 million and total cash and equivalents were $11.4 million at March 31, 2022, which combined represented 34.1% of total assets. Total assets increased $65.5 million, or 9.4%, over the same quarter last year, primarily as a result of increases in investments and core loans, partially offset by decreases in PPP loans and interest-bearing deposits in banks.<\/p>\n<p><strong>Total deposits<\/strong> were $627.3 million at March 31, 2022, a decrease of $405,000, or 0.1%, from $627.8 million at December 31, 2021, and increased by $51.7 million, or 9.0%, compared to $575.7 million at March 31, 2021. Noninterest-bearing deposits grew by 2.5% from the linked quarter, and increased by 21.6% from March 31, 2021, representing 41.8% of total deposits at March 31, 2022.<\/p>\n<p><strong>Total loans<\/strong> <strong>held-for-investment<\/strong> (“HFI”), which excluded loans held-for-sale (“HFS”), were $480.2 million at March 31, 2022, compared to $431.3 million at December 31, 2021, which was an increase of $48.9 million, or 11.3%. Total loans HFI increased $42.6 million, or 9.7%, from March 31, 2021.<\/p>\n<ul>\n<li>PPP loan balances were $8.7 million at March 31, 2022 compared to $15.0 million at December 31, 2021, and $100.4 million at March 31, 2021.<\/li>\n<li>During the quarter, the Company continued to assist its customers through the loan forgiveness application process on the PPP loans originated in 2020 from the first round of the PPP program (“PPP1”) and the loans originated in 2021 from the second round of the PPP program (“PPP2”). As of March 31, 2022, there were approximately $177,000 remaining in fees to be recognized upon forgiveness or repayment of PPP loans.<\/li>\n<li>Excluding PPP loans, core loans were $471.5 million at March 31, 2022, an increase of $55.2 million, or 13.3% during the quarter, and increased $134.3 million, or 39.8%, from March 31, 2021.<\/li>\n<\/ul>\n<p><strong>Subordinated debentures and short-term borrowings<\/strong>, combined, were $50.5 million on March 31, 2022, an increase of $26.0 million compared to the linked quarter and an increase of $11.6 million compared to the same quarter in the prior year. During the fourth quarter 2021, the Company completed a private placement of $20 million of 3.75% Fixed-to-Floating Rate Subordinated Notes due 2031. The notes will mature on October 31, 2031 and will initially bear interest at a rate equal to 3.75% per annum from and including October 1, 2021, to, but excluding, October 31, 2026, payable quarterly in arrears. Thereafter, the notes will bear interest at a floating rate per annum equal to a benchmark rate, which is expected to be Three-Month Term Secured Overnight Financing Rate, plus a spread of 293 basis points, payable quarterly in arrears. After five years, the Company at its option may redeem the notes in whole or in part, on any interest payment date, at an amount equal to one hundred percent (100%) of the outstanding principal amount being redeemed plus accrued but unpaid interest, to but excluding the redemption date. The notes are intended to qualify as Tier 2 capital for regulatory purposes. In addition, the Bank increased its shortterm borrowings $26.0 million during the first quarter of 2022 to help fund its core loan growth of $55.2 million.<\/p>\n<h4>Asset Quality<\/h4>\n<p><strong>Nonperforming assets<\/strong>, which include nonperforming loans and OREO, increased $4.1 million to $5.1 million, or 0.67% of total assets at March 31, 2022, compared to $948,000, or 0.13% of total assets at December 31, 2021, and compared to $1.1 million, or 0.15% of total assets at March 31, 2021. Nonperforming loans, which include non-accrual loans and loans more than 90 days past due and still accruing, were $4.9 million, or 1.02% of total loans HFI at March 31, 2022, compared to $512,000, or 0.12% of total loans HFI at December 31, 2021. The increase in nonperforming loans was largely due to a single real estate loan, on which the Bank has started foreclosure process and expects to resolve by the end of the third quarter 2022. The Bank believes the loan is well-secured and is adequately reserved. OREO balances decreased $236,000 to $200,000 at March 31, 2022, compared to $436,000 at December 31, 2021.<\/p>\n<p><strong>Loans delinquent<\/strong> (past due) 30-89 days were $409,000, or 0.09% of total loans HFI at March 31, 2022, compared to $5.0 million, or 1.17% of total loans HFI at December 31, 2021. The decrease was due to the transfer of a single real estate loan to nonaccrual status, as described above.<\/p>\n<p><strong>The allowance for loan and lease losses<\/strong> (“ALLL”) totaled $3.6 million, or 0.76% of total loans HFI at March 31, 2022. If PPP loans were excluded, the ALLL represented 0.77% of loans HFI (excl PPP) at March 31, 2022. As of March 31, 2022, the Company also had $3.3 million in purchase discounts on loans acquired in the acquisition of the Bank in 2018. When combined, the purchase discounts and ALLL represent 1.44% of total loans HFI at the end of the quarter. Provision for loan losses expense for the quarter ended March 31, 2022, totaled $305,000, compared to $240,000 for the quarter ended December 31, 2021, and $129,000 for the quarter ended March 31, 2021. The increase in the provision expense in the first quarter 2022 was primarily due to core loan growth during the quarter. The Company recorded $47,000 of net charge-offs for the first quarter of 2022 related to the prior period accrued interest on the single real estate loan described above.<\/p>\n<p><strong>Loan modification programs:<\/strong> During the second quarter of 2020, InBank rolled out InNeed, two programs for loan deferrals for borrowers that were adversely affected by the COVID-19 pandemic. The programs allowed an interest-only option for 90 days or a 90-day total payment deferral (interest and principal). The programs were discontinued during the first quarter of 2021. 57 borrowers participated in the programs and 56 borrowers have remained current since returning to fully amortizing payments. One loan was charged off in the first quarter with a of balance less than $1,000.<\/p>\n<h4>Capital<\/h4>\n<p>Capital ratios of the Company and InBank continue to exceed the “well-capitalized” regulatory thresholds. At March 31, 2022, InBank’s leverage ratio was 9.08% and the total risk-based capital ratio was 11.77%. During the fourth quarter 2021, the Company downstreamed $0.5 million of capital into InBank to support the growth in assets.<\/p>\n<p>At March 31, 2022, the Company had tangible common equity (total stockholders’ equity less intangible assets) of $63.8 million and $7.97 tangible book value per share, with 8,000,150 shares of common stock issued and outstanding as of the same date. Tangible common equity decreased $3.5 million compared to December 31, 2021, primarily due to a $4.3 million decrease in accumulated other comprehensive income on investment securities due to rising market interest rates, partially offset by an increase in surplus and retained earnings. During the first quarter 2022, the Bank transferred $95.0 million par value of investment securities from available-for-sale to held-to-maturity designation, consisting primarily of longer duration municipal bonds and mortgage-backed securities. Tangible common equity increased $4.1 million compared to the same quarter in the prior year due to a $8.0 million increase in surplus and retained earnings, partially offset by the $4.6 million decrease in accumulated other comprehensive income. The Company’s tangible common equity to tangible assets ratio was 8.46% at March 31, 2022. The Company and the Bank paid no dividends during the first quarter of 2022.<\/p>\n<h4>Non-GAAP Financial Measures<\/h4>\n<p>Some of the financial measures included in this press release are not measures of financial performance recognized in accordance with generally accepted accounting principles in the United States (“GAAP”). These non-GAAP financial measures include “efficiency ratio,” “tangible common equity,” “tangible common equity to tangible assets,” “tangible book value per share,” and “pre-provision net revenue, or PPNR.” Efficiency ratio is computed by dividing noninterest expense by the sum of net interest income and noninterest income, excluding gain on sale of investment securities and merger and acquisition expense. Tangible common equity is computed by subtracting goodwill and core deposit intangibles from total stockholders’ equity. Tangible common equity to tangible assets is computed by dividing total assets, less goodwill and core deposit intangibles, by tangible common equity. Tangible book value per share is computed by dividing tangible common equity by common shares outstanding. PPNR is computed by adding provision for loan losses expense, merger and acquisition expense, and income tax expense to net income. The Company believes these non-GAAP financial measures provide both management and investors a more complete understanding of the Company’s financial position and performance. These non-GAAP financial measures are supplemental and are not a substitute for any analysis based on GAAP financial measures. Not all companies use the same calculation of these measures; therefore, this presentation may not be comparable to other similarly titled measures as presented by other companies.<\/p>\n<h4>About InBankshares, Corp<\/h4>\n<p>InBankshares, Corp is the holding company for InBank, an independent commercial bank growing throughout the Colorado Front Range and serving southern Colorado and northern New Mexico markets. InBank offers a full suite of commercial, business, personal and mortgage banking solutions with a focus on personalized service, technology, and local decision-making. InBank was built on the entrepreneurial spirit and is led by a team of experienced banking professionals committed to the mission of positively impacting the lives of its customers, communities, and associates. For more information, visit www.InBank.com.<\/p>\n<h4>Forward-Looking Statements<\/h4>\n<p>This press release contains, among other things, certain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including, without limitation, statements preceded by, followed by, or that include the words “may,” “could,” “should,” “would,” “believe,” “anticipate,” “estimate,” “expect,” “intend,” “plan,” “projects,” “outlook” or similar expressions. These statements are based upon the current belief and expectations of the Company’s management team and are subject to significant risks and uncertainties that are subject to change based on various factors (many of which are beyond the Company’s control). Although the Company believes that the assumptions underlying the forward-looking statements are reasonable, any of the assumptions could prove to be inaccurate. Therefore, the Company can give no assurance that the results contemplated in the forward-looking statements will be realized. The inclusion of this forward-looking information should not be construed as a representation by the Company or any other person that the future events, plans, or expectations contemplated by the Company will be achieved.<\/p>\n<p>All subsequent written and oral forward-looking statements attributable to the Company or any person acting on its behalf are expressly qualified in their entirety by the cautionary statements above. The Company does not undertake any obligation to update any forward-looking statement to reflect circumstances or events that occur after the date the forward-looking statements are made, except as required by law.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Denver, CO – April 28, 2022 – InBankshares, Corp (OTCQX: INBC) (the “Company”), parent company of InBank (“InBank” or the “Bank”), today announced its unaudited financial results for the quarter ended March 31, 2022. The Company reported consolidated net income of $444,000 or $0.06 per share, for the first quarter of 2022 compared to $690,000, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[11],"tags":[13],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>InBankshares, Corp Reports First Quarter 2022 Financial Results<\/title>\n<meta name=\"description\" content=\"InBankShare, Corp reports their first quarter 2022 financial results. View the first quarter 2022 financial results.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2022-financial-results\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"InBankshares, Corp Reports First Quarter 2022 Financial Results\" \/>\n<meta property=\"og:description\" content=\"InBankShare, Corp reports their first quarter 2022 financial results. View the first quarter 2022 financial results.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2022-financial-results\/\" \/>\n<meta property=\"og:site_name\" content=\"InBank\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/helloinbank\/\" \/>\n<meta property=\"article:published_time\" content=\"2022-04-28T08:16:10+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-10-28T21:56:03+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/inbank.com\/wp-content\/uploads\/2022\/04\/New-Project-2022-04-27T105212.656-1.png\" \/>\n\t<meta property=\"og:image:width\" content=\"812\" \/>\n\t<meta property=\"og:image:height\" content=\"429\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"inbank-admin\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@GoInBank\" \/>\n<meta name=\"twitter:site\" content=\"@GoInBank\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"inbank-admin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"14 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2022-financial-results\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2022-financial-results\/\"},\"author\":{\"name\":\"inbank-admin\",\"@id\":\"https:\/\/inbank.com\/#\/schema\/person\/3c0356dca598a047a1f3abd42f17ed42\"},\"headline\":\"InBankshares, Corp Reports First Quarter 2022 Financial Results\",\"datePublished\":\"2022-04-28T08:16:10+00:00\",\"dateModified\":\"2022-10-28T21:56:03+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2022-financial-results\/\"},\"wordCount\":2757,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/inbank.com\/#organization\"},\"keywords\":[\"CORP NEWS\"],\"articleSection\":[\"Press Releases\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2022-financial-results\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2022-financial-results\/\",\"url\":\"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2022-financial-results\/\",\"name\":\"InBankshares, Corp Reports First Quarter 2022 Financial Results\",\"isPartOf\":{\"@id\":\"https:\/\/inbank.com\/#website\"},\"datePublished\":\"2022-04-28T08:16:10+00:00\",\"dateModified\":\"2022-10-28T21:56:03+00:00\",\"description\":\"InBankShare, Corp reports their first quarter 2022 financial results. View the first quarter 2022 financial results.\",\"breadcrumb\":{\"@id\":\"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2022-financial-results\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2022-financial-results\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2022-financial-results\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/inbank.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"InBankshares, Corp Reports First Quarter 2022 Financial Results\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/inbank.com\/#website\",\"url\":\"https:\/\/inbank.com\/\",\"name\":\"InBank\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/inbank.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/inbank.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/inbank.com\/#organization\",\"name\":\"InBank\",\"url\":\"https:\/\/inbank.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/inbank.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/inbank.com\/wp-content\/uploads\/2022\/06\/InBank_landscape-1.svg\",\"contentUrl\":\"https:\/\/inbank.com\/wp-content\/uploads\/2022\/06\/InBank_landscape-1.svg\",\"width\":166,\"height\":40,\"caption\":\"InBank\"},\"image\":{\"@id\":\"https:\/\/inbank.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.instagram.com\/go_inbank\/\",\"https:\/\/www.linkedin.com\/company\/goinbank\",\"https:\/\/apps.apple.com\/us\/app\/inbank-business-mobile\/id1449777719\",\"https:\/\/apps.apple.com\/us\/app\/inbank-mobile\/id1449777190\",\"https:\/\/play.google.com\/store\/apps\/details?id=com.mfoundry.mb.android.mb_56t\",\"https:\/\/www.amazon.com\/International-Bank-InBank-Mobile-Tablet\/dp\/B07NW2ZY33\/\",\"https:\/\/www.amazon.com\/International-Bank-InBank-Business-Tablet\/dp\/B07NVVXV34\/\",\"https:\/\/www.facebook.com\/helloinbank\/\",\"https:\/\/twitter.com\/GoInBank\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/inbank.com\/#\/schema\/person\/3c0356dca598a047a1f3abd42f17ed42\",\"name\":\"inbank-admin\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/inbank.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/83a3262ce79cc795dcceda4bf7baa026?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/83a3262ce79cc795dcceda4bf7baa026?s=96&d=mm&r=g\",\"caption\":\"inbank-admin\"},\"sameAs\":[\"https:\/\/inbank.com\"],\"url\":\"https:\/\/inbank.com\/author\/inbank-admin\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"InBankshares, Corp Reports First Quarter 2022 Financial Results","description":"InBankShare, Corp reports their first quarter 2022 financial results. View the first quarter 2022 financial results.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2022-financial-results\/","og_locale":"en_US","og_type":"article","og_title":"InBankshares, Corp Reports First Quarter 2022 Financial Results","og_description":"InBankShare, Corp reports their first quarter 2022 financial results. View the first quarter 2022 financial results.","og_url":"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2022-financial-results\/","og_site_name":"InBank","article_publisher":"https:\/\/www.facebook.com\/helloinbank\/","article_published_time":"2022-04-28T08:16:10+00:00","article_modified_time":"2022-10-28T21:56:03+00:00","og_image":[{"width":812,"height":429,"url":"https:\/\/inbank.com\/wp-content\/uploads\/2022\/04\/New-Project-2022-04-27T105212.656-1.png","type":"image\/png"}],"author":"inbank-admin","twitter_card":"summary_large_image","twitter_creator":"@GoInBank","twitter_site":"@GoInBank","twitter_misc":{"Written by":"inbank-admin","Est. reading time":"14 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2022-financial-results\/#article","isPartOf":{"@id":"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2022-financial-results\/"},"author":{"name":"inbank-admin","@id":"https:\/\/inbank.com\/#\/schema\/person\/3c0356dca598a047a1f3abd42f17ed42"},"headline":"InBankshares, Corp Reports First Quarter 2022 Financial Results","datePublished":"2022-04-28T08:16:10+00:00","dateModified":"2022-10-28T21:56:03+00:00","mainEntityOfPage":{"@id":"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2022-financial-results\/"},"wordCount":2757,"commentCount":0,"publisher":{"@id":"https:\/\/inbank.com\/#organization"},"keywords":["CORP NEWS"],"articleSection":["Press Releases"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2022-financial-results\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2022-financial-results\/","url":"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2022-financial-results\/","name":"InBankshares, Corp Reports First Quarter 2022 Financial Results","isPartOf":{"@id":"https:\/\/inbank.com\/#website"},"datePublished":"2022-04-28T08:16:10+00:00","dateModified":"2022-10-28T21:56:03+00:00","description":"InBankShare, Corp reports their first quarter 2022 financial results. View the first quarter 2022 financial results.","breadcrumb":{"@id":"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2022-financial-results\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2022-financial-results\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2022-financial-results\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/inbank.com\/"},{"@type":"ListItem","position":2,"name":"InBankshares, Corp Reports First Quarter 2022 Financial Results"}]},{"@type":"WebSite","@id":"https:\/\/inbank.com\/#website","url":"https:\/\/inbank.com\/","name":"InBank","description":"","publisher":{"@id":"https:\/\/inbank.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/inbank.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/inbank.com\/#organization","name":"InBank","url":"https:\/\/inbank.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/inbank.com\/#\/schema\/logo\/image\/","url":"https:\/\/inbank.com\/wp-content\/uploads\/2022\/06\/InBank_landscape-1.svg","contentUrl":"https:\/\/inbank.com\/wp-content\/uploads\/2022\/06\/InBank_landscape-1.svg","width":166,"height":40,"caption":"InBank"},"image":{"@id":"https:\/\/inbank.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.instagram.com\/go_inbank\/","https:\/\/www.linkedin.com\/company\/goinbank","https:\/\/apps.apple.com\/us\/app\/inbank-business-mobile\/id1449777719","https:\/\/apps.apple.com\/us\/app\/inbank-mobile\/id1449777190","https:\/\/play.google.com\/store\/apps\/details?id=com.mfoundry.mb.android.mb_56t","https:\/\/www.amazon.com\/International-Bank-InBank-Mobile-Tablet\/dp\/B07NW2ZY33\/","https:\/\/www.amazon.com\/International-Bank-InBank-Business-Tablet\/dp\/B07NVVXV34\/","https:\/\/www.facebook.com\/helloinbank\/","https:\/\/twitter.com\/GoInBank"]},{"@type":"Person","@id":"https:\/\/inbank.com\/#\/schema\/person\/3c0356dca598a047a1f3abd42f17ed42","name":"inbank-admin","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/inbank.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/83a3262ce79cc795dcceda4bf7baa026?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/83a3262ce79cc795dcceda4bf7baa026?s=96&d=mm&r=g","caption":"inbank-admin"},"sameAs":["https:\/\/inbank.com"],"url":"https:\/\/inbank.com\/author\/inbank-admin\/"}]}},"_links":{"self":[{"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/posts\/1002"}],"collection":[{"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/comments?post=1002"}],"version-history":[{"count":3,"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/posts\/1002\/revisions"}],"predecessor-version":[{"id":2740,"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/posts\/1002\/revisions\/2740"}],"wp:attachment":[{"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/media?parent=1002"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/categories?post=1002"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/tags?post=1002"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}