{"id":1858,"date":"2021-05-03T07:43:25","date_gmt":"2021-05-03T07:43:25","guid":{"rendered":"https:\/\/inbank.com\/?p=1858"},"modified":"2022-10-28T22:18:45","modified_gmt":"2022-10-28T22:18:45","slug":"inbankshares-corp-reports-first-quarter-2021-results","status":"publish","type":"post","link":"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2021-results\/","title":{"rendered":"InBankshares, Corp Reports First Quarter 2021 Results"},"content":{"rendered":"<p><em>Company achieved continued balance sheet growth and improved earnings<\/em><\/p>\n<p><strong>Denver, CO – May 3, 2021 – <\/strong>InBankshares, Corp (<a class=\"exitNotifierLink\" href=\"https:\/\/www.otcmarkets.com\/stock\/INBC\/overview\">OTCQX: INBC<\/a>) (the “Company”), parent company of InBank (“InBank” or the “Bank”), today reported its financial results for the quarter ended March 31, 2021. All results are unaudited.<\/p>\n<h4>Highlights for the quarter:<\/h4>\n<ul>\n<li>Net income of $661,000, or $0.09 per share, compared to a loss of $94,000, or $(0.01) per share for Q1-2020, an increase of $755,000<\/li>\n<li>Net interest income of $6.1 million increased $2.1 million, or 52.4% compared to Q1-2020<\/li>\n<li>Loan growth of $26.8 million, or 6.5%, during the first quarter<\/li>\n<li>Year-over-year core loan growth (total loans excluding SBA Paycheck Protection Program, or “PPP”, loans) of $77.0 million, or 29.6%<\/li>\n<li>Deposit growth of $94.1 million, or 19.5%, during the first quarter<\/li>\n<li>Year-over-year deposit growth of $286.4 million, or 99.0%<\/li>\n<li>Net interest margin for the quarter was 3.98%<\/li>\n<li>Funding costs decline to 0.30% in the quarter, a decrease of 5 bps from Q4-2020<\/li>\n<li>Non-performing assets were 0.15% of assets, down from 0.29% in the Q4-2020, and down from 0.77% from Q1-2020<\/li>\n<li>All InNeed interest-only modifications returned to normal payment, and only $2.4 million in loan balances remained in the InNeed full deferral modifications at March 31, 2021<\/li>\n<li>Continued to recruit key additions to the InBankshares and InBank team<\/li>\n<\/ul>\n<p>“I am pleased with such a solid start to 2021 with continued balance sheet growth and earnings momentum. The year has started off with many new beginnings for the Company,” said Ed Francis, Chairman of the Board, President and Chief Executive Officer for the Company and InBank. “Dan Patten, EVP, CFO, has joined the Company from Heartland Financial, USA, Inc., where he served as EVP, Finance and Corporate Development. Dan’s deep experience as a CFO, and in leading numerous M&amp;A transactions will provide significant value to the Company and our shareholders. Dan is serving as a member of our Executive Committee and will have responsibility for finance, accounting, treasury, corporate development and strategy. We also welcomed a new team of seasoned bankers to InBank and announced our plans to enter the Boulder market.  Adrianne Tracy, SVP, Boulder Market President has 20 years of commercial banking experience in Boulder and will be leading our commercial expansion. Adrianne is surrounded by a very talented team of treasury management professionals and will focus on commercial and middle-market opportunities in Boulder and surrounding communities.  These strategic investments in additional talent and capacity that we expect will accelerate market share growth in our Colorado franchise.”<\/p>\n<h4>Results of Operations<\/h4>\n<p><strong>Net income<\/strong> for the quarter was $661,000, or $0.09 per share, compared to a loss of $94,000, or $(0.01) per share, for the same quarter last year, and net income of $237,000, or $0.03 per share, for the linked quarter. The increase over the first quarter of 2020 was primarily the result of an increase in net interest income and a reduction in the provision for loan losses, partially offset by a decrease in noninterest income and an increase in noninterest expense. Similarly, the increase over the linked quarter was primarily the result of an increase in net interest income and a decrease in provision for loan losses, partially offset by a decrease in noninterest income.<\/p>\n<p><strong>Net interest margin<\/strong>, expressed as net interest income as a percentage of average earning assets, was 3.98% during the first quarter of 2021, compared to 4.34% during the first quarter of 2020 and 3.56% during the fourth quarter of 2020.<\/p>\n<p><strong>Net interest income<\/strong> for the quarter was $6.1 million, an increase of $2.1 million, or 52.4%, over the same quarter last year, and an increase of $908,000, or 17.4%, over the linked quarter.<\/p>\n<ul>\n<li>Interest income increased to $6.5 million from $4.7 million during the first quarter of 2020 and $5.6 million during the fourth quarter of 2020.\n<ul>\n<li>The increase compared to first quarter of 2020 was primarily the result of increases in loan and investment portfolio volumes, partially offset by a decrease in the earning asset yield.<\/li>\n<li>Increases over the linked quarter were primarily the result of increases in the loan yields as a result of fees on PPP loans as customers were granted loan forgiveness.<\/li>\n<\/ul>\n<\/li>\n<li>Interest expense decreased to $410,000 from $669,000 during the first quarter of 2020 and $421,000 during the fourth quarter of 2020.\n<ul>\n<li>The decrease was primarily the result of the Company’s cost of funds decreasing to 0.30% during the first quarter of 2021, from 0.35% in the fourth quarter of 2020 and compared to 0.83% during the first quarter of 2021.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p><strong>Noninterest income<\/strong> for the quarter was $568,000, a decrease of $224,000, or 28.3%, over the same quarter last year, and a decrease of $483,000, or 46.0%, over the linked quarter. The current quarter did not have any realized gains on sale of investment securities, compared to sales gains of $350,000 during the first quarter of 2020 and sales gains of $612,000 during the linked fourth quarter of 2020.<\/p>\n<p><strong>Noninterest expense<\/strong> increased 24.1% to $5.7 million for the first quarter of 2021, compared to $4.6 million for the first quarter of 2020, and was up $89,000, or 1.6% on a linked quarter basis.  This was mostly due to an increase in salaries and employee benefits as we continued to hire and invest in new personnel to support our growth plans.<\/p>\n<h4>Balance Sheet Summary<\/h4>\n<p><strong>Total assets<\/strong> were $698.1 million at March 31, 2021, an increase of $89.3 million or 14.7% from $608.7 million at year end 2020. The increase was primarily a result of a $26.8 million increase in total loans, and an increase of $44.5 million in investment securities and of $20.7 million in cash and equivalents, which were funded by growth in deposits. Investment securities were $172.6 million and total cash and equivalents were $60.0 million at March 31, 2021, which combined represented 33.3% of total assets. Total assets increased $274.9, or 64.9%, over the same quarter last year, primarily as a result of increases in loans, investments and cash and equivalents funded by deposit growth.<\/p>\n<p><strong>Total deposits<\/strong> were $575.7 million at March 31, 2021, an increase of $94.1 million, or 19.5%, from $481.6 million at December 31, 2020, and increased by $286.4 million, or 99.9%, compared to $289.3 million at March 31, 2020. Noninterest-bearing deposits grew by 109.2% from a year ago and represented 37.4% of total deposits at March 31, 2021.<\/p>\n<p><strong>Total loans<\/strong>, which excluded loans held-for-sale (“HFS”), were $437.6 million at March 31, 2021, compared to $410.9 million at December 31, 2020, which was an increase of $26.8 million, or 6.5% during the linked quarter. Year-over-year, the total loans increased $176.4 million, or 68.2% from March 31, 2020.<\/p>\n<ul>\n<li>Paycheck Protection Program (PPP) loan balances were $100.4 million at March 31, 2021 compared to $82.9 million at December 31, 2020 and $0 at March 31, 2020.<\/li>\n<li>During the quarter, the Company continued to assist its customers through the loan forgiveness application process on the PPP loans originated in 2020 from the first round of the PPP program (“PPP1”), and also determined to participate in the second round of the PPP program (“PPP2”).<\/li>\n<li>PPP1 loans decreased $32.7 million from year-end 2020, and PPP2 loans totaled $50.3 million at March 31, 2021.<\/li>\n<li>Excluding total PPP loans, core loans were $337.2 million at March 31, 2021, an increase of $9.2 million, or 2.8% (annualized growth of approximately 11%), during the quarter.<\/li>\n<li>Year-over-year, core loans increased $77.0 million, or 29.6%, from March 31, 2020.<\/li>\n<\/ul>\n<h4>Asset Quality<\/h4>\n<p><strong>Nonperforming assets<\/strong>, which included nonperforming loans and other real estate owned (“OREO”), decreased $679,000 to $1.1 million, or 0.15% of total assets at March 31, 2021, compared to $1.7 million, or 0.29% of total assets at December 31, 2020, and compared to $3.3 million, or 0.77% of total assets at March 31, 2020. Nonperforming loans, which include non-accrual loans and loans more than 90 days past due and still accruing, were $486,000, or 0.11% of total loans (excluding HFS) at March 31, 2021, compared to $962,000, or 0.23% of total loans at December 31, 2020. OREO balances decreased to $575,000 at March 31, 2021, compared to $778,000 at December 31, 2020 as the result of two property sales.<\/p>\n<p><img decoding=\"async\" class=\"alignnone size-medium\" src=\"https:\/\/inbank.com\/wp-content\/uploads\/2022\/05\/Q1-2021-Nonperforming-assets-300x168-1.jpg\" \/><\/p>\n<p><strong>Loans delinquent<\/strong> (past due) 30-89 days, were $1.6 million, or 0.37% of total loans (excluding HFS) at March 31, 2021, compared to $424,000, or 0.10% of total loans at December 31, 2020.<\/p>\n<p><strong>The allowance for loan losses<\/strong> (ALL) totaled $2.3 million, or 0.52% of total loans (excluding HFS) at March 31, 2021.  If the PPP loans are excluded, the ALL represents 0.68% of total loans (excluding HFS and PPP loans). The Company also has $3.95 million in purchase discounts on loans acquired in the acquisition of the Bank in 2018. When combined, the purchase discounts and ALL represent 1.43% of the total loans (excluding HFS) at the end of the quarter. Provision for loans losses expense for the quarter ended March 31, 2021, totaled $129,000, compared to $353,000 for the quarter ended December 31, 2020 and $280,000 for the quarter ended March 31, 2020.Net charge-offs\/recoveries of $10,000 were recorded as a recovery for the first three months of 2021.<\/p>\n<p><strong>Loan modifications<\/strong> programs: InBank rolled out InNeed, two programs for loan deferrals for borrowers that were adversely affected by the COVID-19 pandemic. The programs allowed an interest-only option for 90 days or a 90-day total payment deferral (interest and principal).  15 borrowers participated in the interest-only program and as of quarter-end all credits had returned to normal payments without incident.  Below is a chart of the loans that were modified for interest only payments.<\/p>\n<table width=\"592\">\n<tbody>\n<tr>\n<td colspan=\"6\" width=\"592\"><strong>Interest Only Modifications<\/strong><\/td>\n<\/tr>\n<tr>\n<td width=\"97\">Loans Modified<\/td>\n<td width=\"107\">Principal<br \/>\nBalance<\/td>\n<td width=\"85\">Modification<br \/>\nCompleted<\/td>\n<td width=\"112\">Principal<br \/>\nBalance<\/td>\n<td width=\"85\">Modification<br \/>\nOngoing<\/td>\n<td width=\"106\">Principal<br \/>\nBalance<\/td>\n<\/tr>\n<tr>\n<td width=\"97\">15<\/td>\n<td width=\"107\"> $ 15,260,939<\/td>\n<td width=\"85\">15<\/td>\n<td width=\"112\"> $ 15,260,939<\/td>\n<td width=\"85\">0<\/td>\n<td width=\"106\"> $ 0<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>In the total payment deferral program, deferrals were granted on 42 loans representing $55.4 million in outstanding balances.  Hotels represented the greatest concentration of these deferrals.  As of March 31, 2021, 39 of the 42 loans had returned to full payment status from full payment deferral, again without issue and the remaining three loans will be returning to full payment status in the second quarter.<\/p>\n<table width=\"592\">\n<tbody>\n<tr>\n<td colspan=\"6\" width=\"592\"><strong>Full Deferral Modifications<\/strong><\/td>\n<\/tr>\n<tr>\n<td width=\"97\">Loans Modified<\/td>\n<td width=\"107\">Principal<br \/>\nBalance<\/td>\n<td width=\"85\">Modification<br \/>\nCompleted<\/td>\n<td width=\"113\">Principal<br \/>\nBalance<\/td>\n<td width=\"85\">Modification<br \/>\nOngoing<\/td>\n<td width=\"106\">Principal<br \/>\nBalance<\/td>\n<\/tr>\n<tr>\n<td width=\"97\">42<\/td>\n<td width=\"107\"> $ 55,442,455<\/td>\n<td width=\"85\">39<\/td>\n<td width=\"113\"> $ 53,085,506<\/td>\n<td width=\"85\">3<\/td>\n<td width=\"106\"> $ 2,356,949<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>During the first quarter, the States of Colorado and New Mexico experienced improved COVID case counts and lower positivity in conjunction with the vaccine roll out and have reduced restrictions. This has been positive for most industries including retail and hospitality businesses. Management believes that the business environment will normalize during the remainder of 2021 and the need for modifications and deferrals will be reduced or eliminated.  Based on current conditions, the InNeed program has been discontinued.<\/p>\n<p>The Bank is also tracking the recovery of accrued interest on these loans and as of March 31, 2021, 30 of the loans had repaid the interest accrual and were making principal and interest payments.  11 loans still have an accrued interest balance and the accrued interest is expected to be recovered by the first quarter 2022.  One loan was paid in full.<\/p>\n<h4>Capital<\/h4>\n<p>Capital Ratios of the Company and its subsidiary InBank continue to exceed the “well-capitalized” regulatory thresholds. At March 31, 2021, InBank’s leverage ratio was 9.44% and the total risk-based capital ratio was 13.03%. During the first quarter, InBankshares, Corp contributed $6.5 million in capital into InBank.<\/p>\n<p>At March 31, 2021, the Company had tangible common equity (total stockholders’ equity less intangible assets) of $59.7 million and $8.16 tangible book value per common share, with 7,315,116 shares issued and outstanding as of the same date. The Company and the Bank paid no dividends during the quarter.<\/p>\n<h4>About InBankshares, Corp<\/h4>\n<p>InBankshares, Corp is the holding company for InBank, an independent commercial bank growing throughout the Colorado Front Range and serving southern Colorado and northern New Mexico markets. InBank offers a full suite of commercial, business, personal and mortgage banking solutions with a focus on personalized service, technology and local decision-making. InBank was built on the entrepreneurial spirit and is led by a team of experienced banking professionals committed to the mission of positively impacting the lives of its customers, communities and associates. For more information, visit <a class=\"exitNotifierLink\" href=\"https:\/\/avanan.url-protection.com\/v1\/url?o=http%3A\/\/www.InBank.com&amp;g=YTcwY2U1ZWEzZGI1NWQ2OQ==&amp;h=ODc3OTc3NWZlZTAxODczY2UzY2QyZjEzNTFhZDQ1OGVmZWEzZWZkYWQxMzEyNDE5MjAwM2U0MzYzNWQ2NTBlMw==&amp;p=YXAzOmluYmFuazphdmFuYW46bzo0NDMzYzI1YjM0OWNhYTYzOTg0NTU0OGVkYTBlODZlZjp2MQ==\">www.InBank.com<\/a>.<\/p>\n<h4>Forward-Looking Statements<\/h4>\n<p>This press release contains, among other things, certain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including, without limitation, statements preceded by, followed by, or that include the words “may,” “could,” “should,” “would,” “believe,” “anticipate,” “estimate,” “expect,” “intend,” “plan,” “projects,” “outlook” or similar expressions. These statements are based upon the current belief and expectations of the Company’s management team and are subject to significant risks and uncertainties that are subject to change based on various factors (many of which are beyond the Company’s control). Although the Company believes that the assumptions underlying the forward-looking statements are reasonable, any of the assumptions could prove to be inaccurate. Therefore, the Company can give no assurance that the results contemplated in the forward-looking statements will be realized. The inclusion of this forward-looking information should not be construed as a representation by the Company or any person that the future events, plans, or expectations contemplated by the Company will be achieved.<\/p>\n<p>All subsequent written and oral forward-looking statements attributable to the Company or any person acting on its behalf are expressly qualified in their entirety by the cautionary statements above. The Company does not undertake any obligation to update any forward-looking statement to reflect circumstances or events that occur after the date the forward-looking statements are made, except as required by law.<\/p>\n<h4>For further information:<\/h4>\n<p>Amsbry Ball<\/p>\n<p>Investor Relations<\/p>\n<p>Amsbry.Ball@inbank.com<\/p>\n<p># # #<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Company achieved continued balance sheet growth and improved earnings Denver, CO – May 3, 2021 – InBankshares, Corp (OTCQX: INBC) (the “Company”), parent company of InBank (“InBank” or the “Bank”), today reported its financial results for the quarter ended March 31, 2021. All results are unaudited. Highlights for the quarter: Net income of $661,000, or [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[11],"tags":[13],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>InBankshares, Corp Reports First Quarter 2021 Results | InBank<\/title>\n<meta name=\"description\" content=\"InBankshares, Corp has reported their First Quarter 2021 Results. Read through the first quarter 2021 financial results.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2021-results\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"InBankshares, Corp Reports First Quarter 2021 Results | InBank\" \/>\n<meta property=\"og:description\" content=\"InBankshares, Corp has reported their First Quarter 2021 Results. Read through the first quarter 2021 financial results.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2021-results\/\" \/>\n<meta property=\"og:site_name\" content=\"InBank\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/helloinbank\/\" \/>\n<meta property=\"article:published_time\" content=\"2021-05-03T07:43:25+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-10-28T22:18:45+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/inbank.com\/wp-content\/uploads\/2022\/05\/Q1-2021-Nonperforming-assets-300x168-1.jpg\" \/>\n<meta name=\"author\" content=\"inbank-admin\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@GoInBank\" \/>\n<meta name=\"twitter:site\" content=\"@GoInBank\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"inbank-admin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2021-results\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2021-results\/\"},\"author\":{\"name\":\"inbank-admin\",\"@id\":\"https:\/\/inbank.com\/#\/schema\/person\/3c0356dca598a047a1f3abd42f17ed42\"},\"headline\":\"InBankshares, Corp Reports First Quarter 2021 Results\",\"datePublished\":\"2021-05-03T07:43:25+00:00\",\"dateModified\":\"2022-10-28T22:18:45+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2021-results\/\"},\"wordCount\":2030,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/inbank.com\/#organization\"},\"keywords\":[\"CORP NEWS\"],\"articleSection\":[\"Press Releases\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2021-results\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2021-results\/\",\"url\":\"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2021-results\/\",\"name\":\"InBankshares, Corp Reports First Quarter 2021 Results | InBank\",\"isPartOf\":{\"@id\":\"https:\/\/inbank.com\/#website\"},\"datePublished\":\"2021-05-03T07:43:25+00:00\",\"dateModified\":\"2022-10-28T22:18:45+00:00\",\"description\":\"InBankshares, Corp has reported their First Quarter 2021 Results. Read through the first quarter 2021 financial results.\",\"breadcrumb\":{\"@id\":\"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2021-results\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2021-results\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2021-results\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/inbank.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"InBankshares, Corp Reports First Quarter 2021 Results\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/inbank.com\/#website\",\"url\":\"https:\/\/inbank.com\/\",\"name\":\"InBank\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/inbank.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/inbank.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/inbank.com\/#organization\",\"name\":\"InBank\",\"url\":\"https:\/\/inbank.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/inbank.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/inbank.com\/wp-content\/uploads\/2022\/06\/InBank_landscape-1.svg\",\"contentUrl\":\"https:\/\/inbank.com\/wp-content\/uploads\/2022\/06\/InBank_landscape-1.svg\",\"width\":166,\"height\":40,\"caption\":\"InBank\"},\"image\":{\"@id\":\"https:\/\/inbank.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.instagram.com\/go_inbank\/\",\"https:\/\/www.linkedin.com\/company\/goinbank\",\"https:\/\/apps.apple.com\/us\/app\/inbank-business-mobile\/id1449777719\",\"https:\/\/apps.apple.com\/us\/app\/inbank-mobile\/id1449777190\",\"https:\/\/play.google.com\/store\/apps\/details?id=com.mfoundry.mb.android.mb_56t\",\"https:\/\/www.amazon.com\/International-Bank-InBank-Mobile-Tablet\/dp\/B07NW2ZY33\/\",\"https:\/\/www.amazon.com\/International-Bank-InBank-Business-Tablet\/dp\/B07NVVXV34\/\",\"https:\/\/www.facebook.com\/helloinbank\/\",\"https:\/\/twitter.com\/GoInBank\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/inbank.com\/#\/schema\/person\/3c0356dca598a047a1f3abd42f17ed42\",\"name\":\"inbank-admin\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/inbank.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/83a3262ce79cc795dcceda4bf7baa026?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/83a3262ce79cc795dcceda4bf7baa026?s=96&d=mm&r=g\",\"caption\":\"inbank-admin\"},\"sameAs\":[\"https:\/\/inbank.com\"],\"url\":\"https:\/\/inbank.com\/author\/inbank-admin\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"InBankshares, Corp Reports First Quarter 2021 Results | InBank","description":"InBankshares, Corp has reported their First Quarter 2021 Results. Read through the first quarter 2021 financial results.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2021-results\/","og_locale":"en_US","og_type":"article","og_title":"InBankshares, Corp Reports First Quarter 2021 Results | InBank","og_description":"InBankshares, Corp has reported their First Quarter 2021 Results. Read through the first quarter 2021 financial results.","og_url":"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2021-results\/","og_site_name":"InBank","article_publisher":"https:\/\/www.facebook.com\/helloinbank\/","article_published_time":"2021-05-03T07:43:25+00:00","article_modified_time":"2022-10-28T22:18:45+00:00","og_image":[{"url":"https:\/\/inbank.com\/wp-content\/uploads\/2022\/05\/Q1-2021-Nonperforming-assets-300x168-1.jpg"}],"author":"inbank-admin","twitter_card":"summary_large_image","twitter_creator":"@GoInBank","twitter_site":"@GoInBank","twitter_misc":{"Written by":"inbank-admin","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2021-results\/#article","isPartOf":{"@id":"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2021-results\/"},"author":{"name":"inbank-admin","@id":"https:\/\/inbank.com\/#\/schema\/person\/3c0356dca598a047a1f3abd42f17ed42"},"headline":"InBankshares, Corp Reports First Quarter 2021 Results","datePublished":"2021-05-03T07:43:25+00:00","dateModified":"2022-10-28T22:18:45+00:00","mainEntityOfPage":{"@id":"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2021-results\/"},"wordCount":2030,"commentCount":0,"publisher":{"@id":"https:\/\/inbank.com\/#organization"},"keywords":["CORP NEWS"],"articleSection":["Press Releases"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2021-results\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2021-results\/","url":"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2021-results\/","name":"InBankshares, Corp Reports First Quarter 2021 Results | InBank","isPartOf":{"@id":"https:\/\/inbank.com\/#website"},"datePublished":"2021-05-03T07:43:25+00:00","dateModified":"2022-10-28T22:18:45+00:00","description":"InBankshares, Corp has reported their First Quarter 2021 Results. Read through the first quarter 2021 financial results.","breadcrumb":{"@id":"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2021-results\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2021-results\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/inbank.com\/inbankshares-corp-reports-first-quarter-2021-results\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/inbank.com\/"},{"@type":"ListItem","position":2,"name":"InBankshares, Corp Reports First Quarter 2021 Results"}]},{"@type":"WebSite","@id":"https:\/\/inbank.com\/#website","url":"https:\/\/inbank.com\/","name":"InBank","description":"","publisher":{"@id":"https:\/\/inbank.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/inbank.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/inbank.com\/#organization","name":"InBank","url":"https:\/\/inbank.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/inbank.com\/#\/schema\/logo\/image\/","url":"https:\/\/inbank.com\/wp-content\/uploads\/2022\/06\/InBank_landscape-1.svg","contentUrl":"https:\/\/inbank.com\/wp-content\/uploads\/2022\/06\/InBank_landscape-1.svg","width":166,"height":40,"caption":"InBank"},"image":{"@id":"https:\/\/inbank.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.instagram.com\/go_inbank\/","https:\/\/www.linkedin.com\/company\/goinbank","https:\/\/apps.apple.com\/us\/app\/inbank-business-mobile\/id1449777719","https:\/\/apps.apple.com\/us\/app\/inbank-mobile\/id1449777190","https:\/\/play.google.com\/store\/apps\/details?id=com.mfoundry.mb.android.mb_56t","https:\/\/www.amazon.com\/International-Bank-InBank-Mobile-Tablet\/dp\/B07NW2ZY33\/","https:\/\/www.amazon.com\/International-Bank-InBank-Business-Tablet\/dp\/B07NVVXV34\/","https:\/\/www.facebook.com\/helloinbank\/","https:\/\/twitter.com\/GoInBank"]},{"@type":"Person","@id":"https:\/\/inbank.com\/#\/schema\/person\/3c0356dca598a047a1f3abd42f17ed42","name":"inbank-admin","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/inbank.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/83a3262ce79cc795dcceda4bf7baa026?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/83a3262ce79cc795dcceda4bf7baa026?s=96&d=mm&r=g","caption":"inbank-admin"},"sameAs":["https:\/\/inbank.com"],"url":"https:\/\/inbank.com\/author\/inbank-admin\/"}]}},"_links":{"self":[{"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/posts\/1858"}],"collection":[{"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/comments?post=1858"}],"version-history":[{"count":3,"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/posts\/1858\/revisions"}],"predecessor-version":[{"id":2797,"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/posts\/1858\/revisions\/2797"}],"wp:attachment":[{"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/media?parent=1858"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/categories?post=1858"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/tags?post=1858"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}