{"id":1877,"date":"2021-10-27T08:01:44","date_gmt":"2021-10-27T08:01:44","guid":{"rendered":"https:\/\/inbank.com\/?p=1877"},"modified":"2022-10-28T22:10:02","modified_gmt":"2022-10-28T22:10:02","slug":"inbankshares-corp-reports-third-quarter-2021-financial-results","status":"publish","type":"post","link":"https:\/\/inbank.com\/inbankshares-corp-reports-third-quarter-2021-financial-results\/","title":{"rendered":"InBankshares, Corp Reports Third Quarter 2021 Financial Results"},"content":{"rendered":"<p><em>Company continued strong quarterly core loan and noninterest-bearing deposit growth and doubled its year-to-date net income from prior year-to-date<\/em><\/p>\n<p>In a release issued under the same headline on October 26, 2021, by InBankshares, Corp (OTCQX: INBC), please note the following:<\/p>\n<ul>\n<li>In the Consolidated Statements of Condition (Unaudited), “Other short-term borrowings” and “Subordinated debentures” at September 30, 2021, have been changed from 4,890 and 10,000 to 10,000 and 4,890, respectively.<\/li>\n<li>Under “Selected Financial Data (Unaudited)”, Common equity tier 1 capital ratio, Tier 1 capital ratio and Total capital ratio as of and for the quarter ended September 30, 2021, have been changed from34%, 11.34%, and 11.87% to 12.58%, 12.58%, and 13.17%, respectively.<\/li>\n<li>On page 6 of the release under “Capital,” “At September 30, 2021, InBank’s leverage ratio was 9.25% and the total risk-based capital ratio was 11.87%.” has been replaced with “At September 30, 2021, InBank’s leverage ratio was 9.25% and the total risk-based capital ratio was 13.17%.”<\/li>\n<\/ul>\n<p>The corrected release follows:<\/p>\n<p><strong>Denver, CO – October 26, 2021 – <\/strong>InBankshares, Corp (OTCQX: INBC) (the “Company”), parent company of InBank (“InBank” or the “Bank”), today reported its financial results for the quarter ended September 30, 2021. All results are unaudited.<\/p>\n<h4>Highlights for the quarter:<\/h4>\n<ul>\n<li>Quarterly net income of $621,000, or $0.08 per share, compared to $778,000, or $0.10 per share for the linked quarter, and $19,000, or $0.00 per share for Q3-2020<\/li>\n<li>Year-to-date net income of $2.1 million, or $0.27 per share, approximately double the $1.0 million, or $0.15 per share, for the same period in 2020<\/li>\n<li>Core loan growth, excluding SBA Paycheck Protection Program (“PPP”) loans, of $38.0 million, or 10.6%, when compared to the linked quarter and up $108.5 million, or 37.7%, compared to Q3-2020<\/li>\n<li>Total deposit growth of $18.9 million, or 3.3%, when compared to the linked quarter and up $162.5 million, or 37.1%, compared to Q3-2020; noninterest bearing deposits accounted for $18.8 million of the quarterly deposit growth<\/li>\n<li>Net interest margin was 3.45%, compared to 3.73% for the linked quarter and 3.23% for Q3-2020<\/li>\n<li>Funding costs decreased to 0.21% in the quarter, a decrease of 3 basis points from the linked quarter, and a decrease of 15 basis points from Q3-2020<\/li>\n<li>Non-performing assets were 0.10% of assets, down 6 basis points from 0.16% in the linked quarter, and decreased 26 basis points from 0.36% in Q3-2020<\/li>\n<\/ul>\n<p>“I am pleased to report our team’s continued success in building market share as we realized another strong quarter of growth in core loans and noninterest bearing deposits,” said Ed Francis, Chairman of the Board, President and Chief Executive Officer of the Company and InBank. “Excluding PPP fee income and securities gains, the third quarter had the strongest core earnings since the acquisition of the bank in 2018. InBank’s approach to relationship banking is proving successful and we feel confident this approach will continue to allow us to grow top line revenue.”<\/p>\n<h4>Recent Developments<\/h4>\n<p><strong>Subsequent to the third quarter, <\/strong>on October 4, 2021 the Company announced the completion of a private placement of $20 million of 3.75% Fixed-to-Floating Rate Subordinated Notes due 2031. The notes will mature on October 31, 2031 and will initially bear interest at a rate equal to 3.75% per annum from and including October 1, 2021 to, but excluding, October 31, 2026, payable quarterly in arrears. Thereafter, the notes will bear interest at a floating rate per annum equal to a benchmark rate, which is expected to be Three-Month Term Secured Overnight Financing Rate, plus a spread of 293 basis points, payable quarterly in arrears. After five years, the Company at its option may redeem the notes in whole or in part, on any interest payment date, at an amount equal to one hundred percent (100%) of the outstanding principal amount being redeemed plus accrued but unpaid interest, to but excluding the redemption date. The notes are intended to qualify as Tier 2 capital for regulatory purposes.<\/p>\n<h4>Results of Operations<\/h4>\n<p><strong>Net income<\/strong> for the third quarter of 2021 was $621,000, or $0.08 per share, compared to net income of $778,000, or $0.10 per share, for the linked quarter, and $19,000, or $0.00 per share, for the same quarter last year. The decrease over the linked quarter was primarily the result of a decrease in net interest income as a result of lower PPP loan fees and an increase in noninterest expense, partially offset by an increase in noninterest income. The increase from the same quarter last year was primarily the result of an increase in both net interest income and noninterest income, partially offset by increases in noninterest expense and provision for loan losses. Net income for the nine months ended September 30, 2021 was $2.1 million, or $0.27 per share, representing an increase of 98.2% compared to $1.0 million, or $0.15 per share for the same period in 2020.<\/p>\n<p><strong>Net interest margin<\/strong>, expressed as net interest income as a percentage of average earning assets, was 3.45% during the third quarter of 2021, compared to 3.73% during the linked quarter, and 3.23% during the same quarter last year.<\/p>\n<p><strong>Net interest income<\/strong> for the third quarter of 2021 was $5.9 million, a decrease of $347,000, or 5.6%, over the linked quarter, and an increase of $1.2 million, or 26.4%, over the same quarter last year.<\/p>\n<ul>\n<li>Interest income decreased to $6.2 million from $6.6 million during the linked quarter and increased from $5.1 million during the same quarter last year.\n<ul>\n<li>The decrease from the linked quarter was primarily due to a decrease in the fees on PPP loans and a decrease in yields on investment securities, partially offset by an increase in core loan income due to growth in both volume and rate.<\/li>\n<li>The increase compared to same quarter last year was primarily the result of increases in core loans and investment securities balances.<\/li>\n<\/ul>\n<\/li>\n<li>Interest expense decreased to $329,000 from $377,000 during the linked quarter and decreased from $477,000 during the same quarter last year.\n<ul>\n<li>The decrease over the linked quarter was primarily due to an overall decrease in the cost of funds.<\/li>\n<li>The decrease from the same quarter last year was due to a decrease in the cost of interest-bearing deposits and a decrease in the volume of borrowings.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p><strong>Noninterest income<\/strong> for the third quarter of 2021 was $1.1 million, an increase of $290,000, or 36.1%, over the linked quarter, and an increase of $575,000, or 110.8%, from the same quarter last year. The increase over the linked quarter was primarily due to increase in service charges and fees, gain on sale of investment securities and a one-time restitution payment from one of the Bank’s vendors. The increase from the same quarter last year was due to an overall increase in most noninterest income categories, including service charges and fees, SBA and mortgage fees, and gain on sale of investment securities.<\/p>\n<p><strong>Noninterest expense<\/strong> for the third quarter of 2021 was $5.8 million, an increase of $154,000, or 2.7% when compared to the linked quarter, and an increase of 13.7% from $5.1 million for the same quarter last year. The increase over the linked quarter was primarily due to increases in salaries and benefits and an increase in general and administrative expenses as a result of more customer deposits and bank services. The increase over the same quarter last year was mostly due to an increase in salaries and employee benefits expense as we continued to hire and invest in new personnel to support our growth plans.<\/p>\n<p>The Company’s efficiency ratio was 85.1% in the third quarter of 2021, compared with 80.7% in the linked quarter and 99.1% in the third quarter of 2020.<\/p>\n<h4>Balance Sheet Summary<\/h4>\n<p><strong>Total assets<\/strong> were $707.6 million at September 30, 2021, a slight decrease of $817,000, or 0.1%, from $708.4 million at June 30, 2021. During the quarter, there was an increase in investment securities of $19.1 million, a decrease in cash and cash equivalents of $25.9 million, and an increase in total loans of $7.3 million due to an increase of core loans of $38.0 million, partially offset by a decrease of PPP loans of $30.7 million. Investment securities and reverse repurchase agreements combined were $216.6 million and total cash and equivalents were $42.4 million at September 30, 2021, which combined represented 36.6% of total assets. Total assets increased $90.2, or 14.6%, over the same quarter last year, primarily as a result of increases in investments and core loans.<\/p>\n<p><strong>Total deposits<\/strong> were $600.6 million at September 30, 2021, an increase of $18.9 million, or 3.3%, from $581.7 million at June 30, 2021, and increased by $162.5 million, or 37.1%, compared to $438.0 million at September 30, 2020. Noninterest-bearing deposits grew by 8.3% from the linked quarter, grew by 50.4% from September 30, 2020, and represented 40.9% of total deposits at September 30, 2021.<\/p>\n<p><strong>Total loans held-for-investment <\/strong>(“HFI”), which excluded loans held-for-sale (“HFS”), were $425.5 million at September 30, 2021, compared to $418.2 million at June 30, 2021, which was an increase of $7.3 million, or 1.7%. Total loans increased $21.8 million, or 5.4%, from September 30, 2020.<\/p>\n<ul>\n<li>PPP loan balances were $29.0 million at September 30, 2021 compared to $59.7 million at June 30, 2021 and $115.8 million at September 30, 2020.<\/li>\n<li>During the quarter, the Company continued to assist its customers through the loan forgiveness application process on the PPP loans originated in 2020 from the first round of the PPP program (“PPP1”) and the loans originated in 2021 from the second round of the PPP program (“PPP2”). As of September 30, 2021, there was approximately $567,000 remaining in fees to be recognized upon forgiveness or repayment of PPP loans.<\/li>\n<li>Excluding PPP loans, core loans were $396.5 million at September 30, 2021, an increase of $38.0 million, or 10.6% (annualized growth of approximately 42%), during the quarter and increased $108.5 million, or 37.7%, from September 30, 2020.<\/li>\n<\/ul>\n<h4>Asset Quality<\/h4>\n<p><strong>Nonperforming assets<\/strong>, which include nonperforming loans and other real estate owned (“OREO”), decreased $452,000 to $691,000, or 0.10% of total assets at September 30, 2021, compared to $1.1 million, or 0.16% of total assets at June 30, 2021, and compared to $2.2 million, or 0.36% of total assets at September 30, 2020. Nonperforming loans, which include non-accrual loans and loans more than 90 days past due and still accruing, were $287,000, or 0.07% of total loans HFI at September 30, 2021, compared to $728,000, or 0.17% of total loans HFI at June 30, 2021. OREO balances decreased $11,000 to $404,000 at September 30, 2021, compared to $415,000 at June 30, 2021.Remaining OREO consisted of two small properties.<\/p>\n<p><img decoding=\"async\" class=\"alignnone size-medium\" src=\"https:\/\/inbank.com\/wp-content\/uploads\/2022\/05\/Q3-2021-Nonperforming-assets-300x191-1.jpg\" \/><\/p>\n<p><strong>Loans delinquent<\/strong> (past due) 30-89 days were $1.3 million, or 0.30% of total loans HFI at September 30, 2021, compared to $4.9 million, or 1.17% of total loans at June 30, 2021. This decrease was largely due to a single loan that was in the process of renewal in the second quarter.<\/p>\n<p><strong>The allowance for loan and lease losses<\/strong> (“ALLL”) totaled $3.1 million, or 0.72% of total loans HFI at September 30, 2021.  If PPP loans are excluded, the ALLL represented 0.77% of loans HFI (excl PPP) at September 30, 2021. As of September 30, 2021, the Company also had $3.7 million in purchase discounts on loans acquired in the acquisition of the Bank in 2018. When combined, the purchase discounts and ALLL represent 1.58% of total loans HFI at the end of the quarter. Provision for loan loss expense for the quarter ended September 30, 2021 totaled $375,000, compared to $375,000 for the quarter ended June 30, 2021 and $67,000 for the quarter ended September 30, 2020. The Company recorded $4,000 of net recoveries for the second quarter of 2021.<\/p>\n<p><strong>Loan modification<\/strong> <strong>programs<\/strong>: During the second quarter of 2020, InBank rolled out InNeed, two programs for loan deferrals for borrowers that were adversely affected by the COVID-19 pandemic. The programs allowed an interest-only option for 90 days or a 90-day total payment deferral (interest and principal).  The programs were discontinued during the first quarter of 2021. 57 borrowers participated in the programs and all borrowers have remained current since returning to fully amortizing payments.<\/p>\n<h4>Capital<\/h4>\n<p>Capital Ratios of the Company and InBank continue to exceed the “well-capitalized” regulatory thresholds. At September 30, 2021, InBank’s leverage ratio was 9.25% and the total risk-based capital ratio was 13.17%. During the third quarter, the Company downstreamed $3.0 million of capital into InBank. At September 30, 2021, the Company had an additional $2.9 million in cash at the Company level. Subsequent to quarter end, the Company received the $20 million in proceeds (less issuance costs) from the issuance of the subordinated notes described earlier.<\/p>\n<p>At September 30, 2021, the Company had tangible common equity (total stockholders’ equity less intangible assets) of $66.5 million and $8.31 tangible book value per share, with 8,000,150 shares of common stock issued and outstanding as of the same date. The decrease in tangible book value was primarily due to a decrease in the accumulated other comprehensive income as a result of a decreases in net unrealized gains on the Company’s available-for-sale investment securities due to changes in market interest rates. The Company and the Bank paid no dividends during the quarter.<\/p>\n<h4>Non-GAAP Financial Measures<\/h4>\n<p>Some of the financial measures included in this press release are not measures of financial performance recognized in accordance with generally accepted accounting principles in the United States (“GAAP”). These non-GAAP financial measures include “efficiency ratio,” “tangible common equity,” “tangible common equity to tangible assets,” and “tangible book value per share.” Efficiency ratio is computed by dividing noninterest expense by the sum of net interest income and noninterest income, excluding gain on sale of investment securities. Tangible common equity is computed by subtracting goodwill and core deposit intangibles from total stockholders’ equity. Tangible common equity to tangible assets is computed by dividing total assets, less goodwill and core deposit intangibles, by tangible common equity. Tangible book value per share is computed by dividing tangible common equity by common shares outstanding. The Company believes these non-GAAP financial measures provide both management and investors a more complete understanding of the Company’s financial position and performance. These non-GAAP financial measures are supplemental and are not a substitute for any analysis based on GAAP financial measures. Not all companies use the same calculation of these measures; therefore, this presentation may not be comparable to other similarly titled measures as presented by other companies.<\/p>\n<h4>About InBankshares, Corp<\/h4>\n<p>InBankshares, Corp is the holding company for InBank, an independent commercial bank growing throughout the Colorado Front Range and serving southern Colorado and northern New Mexico markets. InBank offers a full suite of commercial, business, personal and mortgage banking solutions with a focus on personalized service, technology and local decision-making. InBank was built on the entrepreneurial spirit and is led by a team of experienced banking professionals committed to the mission of positively impacting the lives of its customers, communities and associates. For more information, visit www.InBank.com.<\/p>\n<h4>Forward-Looking Statements<\/h4>\n<p>This press release contains, among other things, certain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including, without limitation, statements preceded by, followed by, or that include the words “may,” “could,” “should,” “would,” “believe,” “anticipate,” “estimate,” “expect,” “intend,” “plan,” “projects,” “outlook” or similar expressions. These statements are based upon the current belief and expectations of the Company’s management team and are subject to significant risks and uncertainties that are subject to change based on various factors (many of which are beyond the Company’s control). Although the Company believes that the assumptions underlying the forward-looking statements are reasonable, any of the assumptions could prove to be inaccurate. Therefore, the Company can give no assurance that the results contemplated in the forward-looking statements will be realized. The inclusion of this forward-looking information should not be construed as a representation by the Company or any person that the future events, plans, or expectations contemplated by the Company will be achieved.<\/p>\n<p>All subsequent written and oral forward-looking statements attributable to the Company or any person acting on its behalf are expressly qualified in their entirety by the cautionary statements above. The Company does not undertake any obligation to update any forward-looking statement to reflect circumstances or events that occur after the date the forward-looking statements are made, except as required by law.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Company continued strong quarterly core loan and noninterest-bearing deposit growth and doubled its year-to-date net income from prior year-to-date In a release issued under the same headline on October 26, 2021, by InBankshares, Corp (OTCQX: INBC), please note the following: In the Consolidated Statements of Condition (Unaudited), “Other short-term borrowings” and “Subordinated debentures” at September [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[11],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v19.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>InBankshares, Corp Reports Third Quarter 2021 Financial Results<\/title>\n<meta name=\"description\" content=\"InBankshares, Corp has reported the Third Quarter 2021 Financial Results. Read the 2021 third quarter financial results.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/inbank.com\/inbankshares-corp-reports-third-quarter-2021-financial-results\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"InBankshares, Corp Reports Third Quarter 2021 Financial Results\" \/>\n<meta property=\"og:description\" content=\"InBankshares, Corp has reported the Third Quarter 2021 Financial Results. Read the 2021 third quarter financial results.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/inbank.com\/inbankshares-corp-reports-third-quarter-2021-financial-results\/\" \/>\n<meta property=\"og:site_name\" content=\"InBank\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/helloinbank\/\" \/>\n<meta property=\"article:published_time\" content=\"2021-10-27T08:01:44+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-10-28T22:10:02+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/inbank.com\/wp-content\/uploads\/2022\/05\/Q3-2021-Nonperforming-assets-300x191-1.jpg\" \/>\n<meta name=\"author\" content=\"inbank-admin\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@GoInBank\" \/>\n<meta name=\"twitter:site\" content=\"@GoInBank\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"inbank-admin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"13 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/inbank.com\/inbankshares-corp-reports-third-quarter-2021-financial-results\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/inbank.com\/inbankshares-corp-reports-third-quarter-2021-financial-results\/\"},\"author\":{\"name\":\"inbank-admin\",\"@id\":\"https:\/\/inbank.com\/#\/schema\/person\/3c0356dca598a047a1f3abd42f17ed42\"},\"headline\":\"InBankshares, Corp Reports Third Quarter 2021 Financial Results\",\"datePublished\":\"2021-10-27T08:01:44+00:00\",\"dateModified\":\"2022-10-28T22:10:02+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/inbank.com\/inbankshares-corp-reports-third-quarter-2021-financial-results\/\"},\"wordCount\":2449,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/inbank.com\/#organization\"},\"articleSection\":[\"Press Releases\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/inbank.com\/inbankshares-corp-reports-third-quarter-2021-financial-results\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/inbank.com\/inbankshares-corp-reports-third-quarter-2021-financial-results\/\",\"url\":\"https:\/\/inbank.com\/inbankshares-corp-reports-third-quarter-2021-financial-results\/\",\"name\":\"InBankshares, Corp Reports Third Quarter 2021 Financial Results\",\"isPartOf\":{\"@id\":\"https:\/\/inbank.com\/#website\"},\"datePublished\":\"2021-10-27T08:01:44+00:00\",\"dateModified\":\"2022-10-28T22:10:02+00:00\",\"description\":\"InBankshares, Corp has reported the Third Quarter 2021 Financial Results. Read the 2021 third quarter financial results.\",\"breadcrumb\":{\"@id\":\"https:\/\/inbank.com\/inbankshares-corp-reports-third-quarter-2021-financial-results\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/inbank.com\/inbankshares-corp-reports-third-quarter-2021-financial-results\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/inbank.com\/inbankshares-corp-reports-third-quarter-2021-financial-results\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/inbank.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"InBankshares, Corp Reports Third Quarter 2021 Financial Results\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/inbank.com\/#website\",\"url\":\"https:\/\/inbank.com\/\",\"name\":\"InBank\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/inbank.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/inbank.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/inbank.com\/#organization\",\"name\":\"InBank\",\"url\":\"https:\/\/inbank.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/inbank.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/inbank.com\/wp-content\/uploads\/2022\/06\/InBank_landscape-1.svg\",\"contentUrl\":\"https:\/\/inbank.com\/wp-content\/uploads\/2022\/06\/InBank_landscape-1.svg\",\"width\":166,\"height\":40,\"caption\":\"InBank\"},\"image\":{\"@id\":\"https:\/\/inbank.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.instagram.com\/go_inbank\/\",\"https:\/\/www.linkedin.com\/company\/goinbank\",\"https:\/\/apps.apple.com\/us\/app\/inbank-business-mobile\/id1449777719\",\"https:\/\/apps.apple.com\/us\/app\/inbank-mobile\/id1449777190\",\"https:\/\/play.google.com\/store\/apps\/details?id=com.mfoundry.mb.android.mb_56t\",\"https:\/\/www.amazon.com\/International-Bank-InBank-Mobile-Tablet\/dp\/B07NW2ZY33\/\",\"https:\/\/www.amazon.com\/International-Bank-InBank-Business-Tablet\/dp\/B07NVVXV34\/\",\"https:\/\/www.facebook.com\/helloinbank\/\",\"https:\/\/twitter.com\/GoInBank\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/inbank.com\/#\/schema\/person\/3c0356dca598a047a1f3abd42f17ed42\",\"name\":\"inbank-admin\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/inbank.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/83a3262ce79cc795dcceda4bf7baa026?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/83a3262ce79cc795dcceda4bf7baa026?s=96&d=mm&r=g\",\"caption\":\"inbank-admin\"},\"sameAs\":[\"https:\/\/inbank.com\"],\"url\":\"https:\/\/inbank.com\/author\/inbank-admin\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"InBankshares, Corp Reports Third Quarter 2021 Financial Results","description":"InBankshares, Corp has reported the Third Quarter 2021 Financial Results. Read the 2021 third quarter financial results.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/inbank.com\/inbankshares-corp-reports-third-quarter-2021-financial-results\/","og_locale":"en_US","og_type":"article","og_title":"InBankshares, Corp Reports Third Quarter 2021 Financial Results","og_description":"InBankshares, Corp has reported the Third Quarter 2021 Financial Results. Read the 2021 third quarter financial results.","og_url":"https:\/\/inbank.com\/inbankshares-corp-reports-third-quarter-2021-financial-results\/","og_site_name":"InBank","article_publisher":"https:\/\/www.facebook.com\/helloinbank\/","article_published_time":"2021-10-27T08:01:44+00:00","article_modified_time":"2022-10-28T22:10:02+00:00","og_image":[{"url":"https:\/\/inbank.com\/wp-content\/uploads\/2022\/05\/Q3-2021-Nonperforming-assets-300x191-1.jpg"}],"author":"inbank-admin","twitter_card":"summary_large_image","twitter_creator":"@GoInBank","twitter_site":"@GoInBank","twitter_misc":{"Written by":"inbank-admin","Est. reading time":"13 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/inbank.com\/inbankshares-corp-reports-third-quarter-2021-financial-results\/#article","isPartOf":{"@id":"https:\/\/inbank.com\/inbankshares-corp-reports-third-quarter-2021-financial-results\/"},"author":{"name":"inbank-admin","@id":"https:\/\/inbank.com\/#\/schema\/person\/3c0356dca598a047a1f3abd42f17ed42"},"headline":"InBankshares, Corp Reports Third Quarter 2021 Financial Results","datePublished":"2021-10-27T08:01:44+00:00","dateModified":"2022-10-28T22:10:02+00:00","mainEntityOfPage":{"@id":"https:\/\/inbank.com\/inbankshares-corp-reports-third-quarter-2021-financial-results\/"},"wordCount":2449,"commentCount":0,"publisher":{"@id":"https:\/\/inbank.com\/#organization"},"articleSection":["Press Releases"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/inbank.com\/inbankshares-corp-reports-third-quarter-2021-financial-results\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/inbank.com\/inbankshares-corp-reports-third-quarter-2021-financial-results\/","url":"https:\/\/inbank.com\/inbankshares-corp-reports-third-quarter-2021-financial-results\/","name":"InBankshares, Corp Reports Third Quarter 2021 Financial Results","isPartOf":{"@id":"https:\/\/inbank.com\/#website"},"datePublished":"2021-10-27T08:01:44+00:00","dateModified":"2022-10-28T22:10:02+00:00","description":"InBankshares, Corp has reported the Third Quarter 2021 Financial Results. Read the 2021 third quarter financial results.","breadcrumb":{"@id":"https:\/\/inbank.com\/inbankshares-corp-reports-third-quarter-2021-financial-results\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/inbank.com\/inbankshares-corp-reports-third-quarter-2021-financial-results\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/inbank.com\/inbankshares-corp-reports-third-quarter-2021-financial-results\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/inbank.com\/"},{"@type":"ListItem","position":2,"name":"InBankshares, Corp Reports Third Quarter 2021 Financial Results"}]},{"@type":"WebSite","@id":"https:\/\/inbank.com\/#website","url":"https:\/\/inbank.com\/","name":"InBank","description":"","publisher":{"@id":"https:\/\/inbank.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/inbank.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/inbank.com\/#organization","name":"InBank","url":"https:\/\/inbank.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/inbank.com\/#\/schema\/logo\/image\/","url":"https:\/\/inbank.com\/wp-content\/uploads\/2022\/06\/InBank_landscape-1.svg","contentUrl":"https:\/\/inbank.com\/wp-content\/uploads\/2022\/06\/InBank_landscape-1.svg","width":166,"height":40,"caption":"InBank"},"image":{"@id":"https:\/\/inbank.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.instagram.com\/go_inbank\/","https:\/\/www.linkedin.com\/company\/goinbank","https:\/\/apps.apple.com\/us\/app\/inbank-business-mobile\/id1449777719","https:\/\/apps.apple.com\/us\/app\/inbank-mobile\/id1449777190","https:\/\/play.google.com\/store\/apps\/details?id=com.mfoundry.mb.android.mb_56t","https:\/\/www.amazon.com\/International-Bank-InBank-Mobile-Tablet\/dp\/B07NW2ZY33\/","https:\/\/www.amazon.com\/International-Bank-InBank-Business-Tablet\/dp\/B07NVVXV34\/","https:\/\/www.facebook.com\/helloinbank\/","https:\/\/twitter.com\/GoInBank"]},{"@type":"Person","@id":"https:\/\/inbank.com\/#\/schema\/person\/3c0356dca598a047a1f3abd42f17ed42","name":"inbank-admin","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/inbank.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/83a3262ce79cc795dcceda4bf7baa026?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/83a3262ce79cc795dcceda4bf7baa026?s=96&d=mm&r=g","caption":"inbank-admin"},"sameAs":["https:\/\/inbank.com"],"url":"https:\/\/inbank.com\/author\/inbank-admin\/"}]}},"_links":{"self":[{"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/posts\/1877"}],"collection":[{"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/comments?post=1877"}],"version-history":[{"count":2,"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/posts\/1877\/revisions"}],"predecessor-version":[{"id":2741,"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/posts\/1877\/revisions\/2741"}],"wp:attachment":[{"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/media?parent=1877"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/categories?post=1877"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/inbank.com\/wp-json\/wp\/v2\/tags?post=1877"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}